const questions = {
  covid: {
    question: "გაქვს გადატანილი Covid-19?*",
    answers: ["კი", "არა", "ახლა მაქვს"],
    ifYes: {
      question: "ანტისხეულების ტესტი გაქვს გაკეთებული?*",
      answers: ["კი", "არა"],
    },
  },
  vaccination: {
    question: "უკვე გაკეთებული გაქვს ვაქცინა?*",
    answers: ["კი", "არა"],
    ifYes: {
      question: "აირჩიე რა ეტაპზე ხარ*",
      answers: [
        "პირველი დოზა და დარეგისტრირებული ვარ მეორეზე",
        "სრულად აცრილი ვარ",
        "პირველი დოზა და არ დავრეგისტრირებულვარ მეორეზე",
      ],
    },
    ifNo: {
      question: "რას ელოდები?*",
      answers: [
        "დარეგისტრირებული ვარ და ველოდები თარიღს",
        "არ ვგეგმავ",
        "გადატანილი მაქვს და ვგეგმავ აცრას",
      ],
    },
  },
  advices: {
    onlineMeetups: {
      question:
        "რა სიხშირით შეიძლება გვქონდეს საერთო არაფორმალური ონლაინ შეხვედრები, სადაც ყველა სურვილისამებრ ჩაერთვება*",
      answers: [
        "კვირაში ორჯერ",
        "კვირაში ერთხელ",
        "ორ კვირაში ერთხელ",
        "თვეში ერთხელ",
      ],
    },
    workInOffice: {
      question: "კვირაში რადენი დღე ისურვებდი ოფისიდან მუშაობას?*",
      answers: ["0", "1", "2", "3", "4", "5"],
    },
    physicalMeetups: {
      question: "რას ფიქრობ ფიზიკურ შეკრებებზე?",
    },
    currentOpinion: {
      question:
        "რას ფიქრობ არსებულ გარემოზე: რა მოგწონს, რას დაამატებდი, რას შეცვლიდი?",
    },
  },
};

export default questions;
