const questions = {
  covid: {
    question: "გაქვს გადატანილი Covid-19?*",
    answers: ["კი", "არა", "ახლა მაქვს"],
    ifYes: {
      question: "ანტისხეულების ტესტი გაქვს გაკეთებული?*",
      answers: ["კი", "არა"],
    },
  },
  vaccination: {
    question: "უკვე გაკეთებული გაქვს ვაქცინა?*",
    answers: ["კი", "არა"],
    ifYes: {
      question: "აირჩიე რა ეტაპზე ხარ*",
      answers: [
        "პირველი დოზა და დარეგისტრირებული ვარ მეორეზე",
        "სრულად აცრილი ვარ",
        "პირველი დოზა და არ დავრეგისტრირებულვარ მეორეზე",
      ],
    },
    ifNo: {
      question: "რას ელოდები?*",
      answers: [
        "დარეგისტრირებული ვარ და ველოდები თარიღს",
        "არ ვგეგმავ",
        "გადატანილი მაქვს და ვგეგმავ აცრას",
      ],
    },
  },
};

export default questions;
